//<![CDATA[
    var ROOT = "/where-buy";
        $(document).ready(function () {
        $(".maps").gmap3({
            map:{
               options:{
                mapTypeControl: false,
                navigationControl: false,
                streetViewControl: false,
                center: [49.196064,31.025391],
                zoom: 5
               }
            },
                        marker: {
                values:[                                                {
                            latLng:[44.929534,34.114884], 
                            data : { 
                                text : '<p class="tc infowindow">ЮМИСС" ООО<br />Симферополь, ул. Крылова 127<br />38 (0652) 27-45-18</p>'
                            }
                        },                                                                                            {
                            latLng:[44.9336724,34.0552412], 
                            data : { 
                                text : '<p class="tc infowindow">Шунгит" ООО <br />Симферополь, переулок Химический, 4<br />38 (067) 564-14-07</p>'
                            }
                        },                                                                                            {
                            latLng:[49.22581,28.529924], 
                            data : { 
                                text : '<p class="tc infowindow">Заришняк И. М." ФОП <br />Винница, ул.Чехова, 29<br />38 (0432) 55-74-14</p>'
                            }
                        },                                                                                            {
                            latLng:[49.829955,23.949981], 
                            data : { 
                                text : '<p class="tc infowindow">Гермес Трейдинг ЛТД." ЧП <br />Львов, ул.Курмановича,1<br />38 (032) 245-88-58</p>'
                            }
                        },                                                                                            {
                            latLng:[48.4394400,35.0205680], 
                            data : { 
                                text : '<p class="tc infowindow">Шунгит" ООО <br />Днепр, ул. Богдана Хмельницкого, 20<br />38 (056) 374-71-48</p>'
                            }
                        },                                                                                            {
                            latLng:[50.271335,28.714096], 
                            data : { 
                                text : '<p class="tc infowindow">Гермес Трейдинг ЛТД." ЧП <br />Житомир, ул.Кооперативная, 20<br />38 (067) 208-81-11</p>'
                            }
                        },                                                                                            {
                            latLng:[49.829955,23.949981], 
                            data : { 
                                text : '<p class="tc infowindow">Гермес Трейдинг ЛТД." ЧП <br />Львов, ул.Курмановича,1<br />38 (032) 245-88-58</p>'
                            }
                        },                                                                                            {
                            latLng:[48.4394400,35.0205680], 
                            data : { 
                                text : '<p class="tc infowindow">Шунгит" ООО <br />Днепропетровск, ул. Героев Сталинграда, 20<br />38 (056) 374-71-48</p>'
                            }
                        },                                                                                            {
                            latLng:[48.9349436,24.7171028], 
                            data : { 
                                text : '<p class="tc infowindow">Вест-МИМ" ЧП <br />Ивано-Франковск, ул. Ушинского, 1<br />38 (0342) 71-25-62</p>'
                            }
                        },                                                                                            {
                            latLng:[50.453228,30.416826], 
                            data : { 
                                text : '<p class="tc infowindow">Гермес Трейдинг ЛТД." ЧП <br />Киев, ул.Н.Василенко 2<br />38 (044)  490-91-96 </p>'
                            }
                        },                                                                                            {
                            latLng:[48.522176,32.203524], 
                            data : { 
                                text : '<p class="tc infowindow">Гермес Трейдинг ЛТД." ЧП <br />Кропивницкий, ул.Промышленная, 11<br />38 (098) 282-04-13</p>'
                            }
                        },                                                                                            {
                            latLng:[49.829955,23.949981], 
                            data : { 
                                text : '<p class="tc infowindow">Гермес Трейдинг ЛТД." ЧП <br />Львов, ул.Курмановича,1<br />38 (032) 245-88-58</p>'
                            }
                        },                                                                                            {
                            latLng:[46.955074,32.065369], 
                            data : { 
                                text : '<p class="tc infowindow">ПЛАМЕР" ЧП <br />Николаев, ул.4-я Продольная, 74<br />38 (050) 589-13-90</p>'
                            }
                        },                                                                                            {
                            latLng:[46.465177,30.656748], 
                            data : { 
                                text : '<p class="tc infowindow">ПЛАМЕР" ЧП <br />Одесса, ул.Просёлочная, 10-а<br />38 (048) 743-76-06</p>'
                            }
                        },                                                                                            {
                            latLng:[49.602367,34.474068], 
                            data : { 
                                text : '<p class="tc infowindow">Минимакси" ЧП <br />Полтава, ул. Заводская, 10<br />38 (0532) 66-99-60</p>'
                            }
                        },                                                                                            {
                            latLng:[50.626734,26.285648], 
                            data : { 
                                text : '<p class="tc infowindow">Ольвия" ООО <br />Ровно ул.Костромская, 25<br />38 (0362) 69-09-02</p>'
                            }
                        },                                                                                            {
                            latLng:[50.931793,34.800696], 
                            data : { 
                                text : '<p class="tc infowindow">СИВЕРИЯ" ООО <br />Сумы, пер. 1-й Заводской, 2<br />38 (0542) 25-20-74</p>'
                            }
                        },                                                                                            {
                            latLng:[49.576981,25.624173], 
                            data : { 
                                text : '<p class="tc infowindow">СТЭН" ООО <br />Тернополь, ул. Текстильная, 30 а<br />38 (0352) 52-02-20</p>'
                            }
                        },                                                                                            {
                            latLng:[50.011228,36.308441], 
                            data : { 
                                text : '<p class="tc infowindow">АВС Дом" ЧП <br />Харьков, ул. Козакевича, 22а<br />38 (050) 425-00-62</p>'
                            }
                        },                                                                                            {
                            latLng:[46.675671,32.591597], 
                            data : { 
                                text : '<p class="tc infowindow">ОптЦентр" ООО <br />Херсон, ул. Кольцова, 57<br />38 (0552) 41-01-02</p>'
                            }
                        },                                                                                            {
                            latLng:[49.4310206,32.0867515], 
                            data : { 
                                text : '<p class="tc infowindow">Гегельская О.О." ЧП  <br />Черкассы, ул. Энгельса, 259/1<br />38 (047) 232-63-69</p>'
                            }
                        },                                                                                            {
                            latLng:[48.753784,30.214012], 
                            data : { 
                                text : '<p class="tc infowindow">Лысак А.Е." ЧП ("Евродом")<br />Умань, ул. Парижской Комуны, 2/38<br />38 (067) 470-96-99</p>'
                            }
                        },                                                                                            {
                            latLng:[51.526368,30.744145], 
                            data : { 
                                text : '<p class="tc infowindow">Смена" ООО <br />Чернигов,  ул. 77 Гвардейской дивизии, 1<br />38 (0462) 601-535</p>'
                            }
                        },                                                                                            {
                            latLng:[48.297184,25.936618], 
                            data : { 
                                text : '<p class="tc infowindow">Астрея"<br />Черновцы, ул. Головна, 3<br />38 (095) 330-47-38</p>'
                            }
                        },                                                                                            {
                            latLng:[51.1722300,71.4253914], 
                            data : { 
                                text : '<p class="tc infowindow">BULAK" TOO<br />Астана, пр. Республики, 166<br />7 (7172) 39-84-36</p>'
                            }
                        },                                                                                            {
                            latLng:[42.846143,74.618368], 
                            data : { 
                                text : '<p class="tc infowindow">Курулуш плюс" СКР ОсОО <br />Бишкек, ул.Матросова,3<br />996 (312) 59-19-13</p>'
                            }
                        },                                                                                            {
                            latLng:[56.972223,24.064415], 
                            data : { 
                                text : '<p class="tc infowindow">МИТАХА" ООО <br />Рига, ул.Лидоню 6 Б, <br />371 (67) 33-62-13</p>'
                            }
                        },                                                                                            {
                            latLng:[54.631822,25.264885], 
                            data : { 
                                text : '<p class="tc infowindow">АЙДОРА" ЗАО <br />Вильнюс, ул.Метало, 23<br />370 (5) 213-38-31</p>'
                            }
                        },                                                                                            {
                            latLng:[47.001797,28.870654], 
                            data : { 
                                text : '<p class="tc infowindow">Bicomplex" SRL<br />Кишинев, Chisinau, sos.Muncesti 89<br />373 (22) 50-50-90</p>'
                            }
                        },                                                                                            {
                            latLng:[53.849691,27.511225], 
                            data : { 
                                text : '<p class="tc infowindow">Чистый берег" ЗАО <br />Минск, ул. Казинца,83<br />375 (17) 212-32-16</p>'
                            }
                        },                                                                                            {
                            latLng:[51.682455,39.167823], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехническая компания Аки"<br />Воронеж, ул. Машиностроителей, 8<br />7 (4732) 77-49-99 </p>'
                            }
                        },                                                                                            {
                            latLng:[56.251457,43.990089], 
                            data : { 
                                text : '<p class="tc infowindow">Валитов"<br />Нижний Новгород, ул. Крутояровская, 22<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[47.107698,39.757534], 
                            data : { 
                                text : '<p class="tc infowindow">Грандфаянс"<br />Ростов, ул. Страны Советов д.19<br />7(863)255-25-06(07-09)</p>'
                            }
                        },                                                                                            {
                            latLng:[45.043175,39.126084], 
                            data : { 
                                text : '<p class="tc infowindow">Касьянова "Сантехопт-Кубань"<br />Краснодар, ул. Уральская 222 <br />7 (8612) 01-22-84</p>'
                            }
                        },                                                                                            {
                            latLng:[47.236762,39.704393], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехлит "БИЛД"<br />Ростов-на-Дону, ул. Мечникова, 140 А<br />7(863)227-32-32; 227-31-65</p>'
                            }
                        },                                                                                            {
                            latLng:[45.063579,38.971657], 
                            data : { 
                                text : '<p class="tc infowindow">СЕАН "Золотой Век"<br /> Краснодар, ул. Кирова, д. 145<br />7(861)234-97-31(32-33); 255-53-13</p>'
                            }
                        },                                                                                            {
                            latLng:[42.952135,47.50651], 
                            data : { 
                                text : '<p class="tc infowindow">Гаджимагомедов "Тортуга"<br />Махачкала, пр. Крылова, д. 4. рынок Анжи базар<br />7 (8722) 61-04-34</p>'
                            }
                        },                                                                                            {
                            latLng:[55.83888,37.40795], 
                            data : { 
                                text : '<p class="tc infowindow">ИмпортСтрой"<br />Москва, ул.Василия Петушкова, д.27<br />7 (495) 922-08-79  </p>'
                            }
                        },                                                                                            {
                            latLng:[54.682912,20.487374], 
                            data : { 
                                text : '<p class="tc infowindow">ИНСАН"<br />Калининград, ул. Киевская 36-40 <br />7 (4012) 58-14-33</p>'
                            }
                        },                                                                                            {
                            latLng:[55.381341,86.071612], 
                            data : { 
                                text : '<p class="tc infowindow">Линкер"<br />Кемерово, ул.Мариинская, 2<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[59.876512,30.332044], 
                            data : { 
                                text : '<p class="tc infowindow">Мегатек"<br />Санкт-Петербург, пл. Конституции, д. 7,офис 412А<br />7(812) 602-29-52</p>'
                            }
                        },                                                                                            {
                            latLng:[55.809662,49.066912], 
                            data : { 
                                text : '<p class="tc infowindow">Петрел"<br />Казань, ул. Гладилова, 53<br />7 (843) 555-32-01</p>'
                            }
                        },                                                                                            {
                            latLng:[55.828625,49.195143], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехтрейд"<br />Казань, ул.Журналистов, 100<br />7 (843) 273-00-34</p>'
                            }
                        },                                                                                            {
                            latLng:[48.689827,44.488185], 
                            data : { 
                                text : '<p class="tc infowindow">Кульченко "Славянские обои"<br />Волгоград, ул. Моторная, д. 5<br />7(8442) 53-18-05</p>'
                            }
                        },                                                                                            {
                            latLng:[51.571735,46.030601], 
                            data : { 
                                text : '<p class="tc infowindow">ТИ КОСС"<br />Саратов,  ул. Бирюзова 14 А<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[53.122504,45.015596], 
                            data : { 
                                text : '<p class="tc infowindow">ГК Флекси<br />Пенза, ул.Перспективная,  д.1<br />7(8412) 38-15-10</p>'
                            }
                        },                                                                                            {
                            latLng:[51.75934,36.133636], 
                            data : { 
                                text : '<p class="tc infowindow">ГК Флекси<br />Курск, ул. Гремяченская,д. 6<br />7(4712) 73-04-10</p>'
                            }
                        },                                                                                            {
                            latLng:[56.096532,40.263255], 
                            data : { 
                                text : '<p class="tc infowindow">Шарипов "Сантехстройсервис"<br />Владимир, мкр Юрьевец, ул. Станционная, дом 2, а/я 67<br />7(4922) 36-94-93, 36-90-01, 36-91-11, 26-15-05, 26-02-02</p>'
                            }
                        },                                                                                            {
                            latLng:[55.03438,73.374571], 
                            data : { 
                                text : '<p class="tc infowindow">ИМПЭКС"<br />Омск, ул.Осоавиахимовская, 294<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[56.817723,60.682934], 
                            data : { 
                                text : '<p class="tc infowindow">АС Трейдинг"<br />Екатеринбург,  Карьерная ул., д. № 24, 3 этаж, оф. 1<br />7 (343) 253-72-06</p>'
                            }
                        },                                                                                            {
                            latLng:[44.033848,43.04355], 
                            data : { 
                                text : '<p class="tc infowindow">Юфо-оптторг"<br />Пятигорск, Черкесское шоссе, 31 <br />7(8793) 318444</p>'
                            }
                        },                                                                                            {
                            latLng:[57.777561,41.005733], 
                            data : { 
                                text : '<p class="tc infowindow">Колумб"<br />Кострома, ул. Зеленая, 10<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[54.992314,82.965142], 
                            data : { 
                                text : '<p class="tc infowindow">Инвестком"<br />Новосибирск, ул. Большевистская, 92 <br />7 (383) 230-30-83</p>'
                            }
                        },                                                                                            {
                            latLng:[55.587574,37.599074], 
                            data : { 
                                text : '<p class="tc infowindow">Ника-Трейд"<br />Москва, Варшавское ш., д.141<br />7 (495) 660-50-77</p>'
                            }
                        },                                                                                            {
                            latLng:[57.620795,39.826935], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехкомплект"<br />Ярославль, ул. Магистральная,14 <br />7 (4852) 21-99-15</p>'
                            }
                        },                                                                                            {
                            latLng:[55.71882,37.779705], 
                            data : { 
                                text : '<p class="tc infowindow">СанТехОптТорг"<br />Люберцы, мкр. Птицефабрика, корп. 10, лит. 7Р<br />7(495) 627-76-76</p>'
                            }
                        },                                                                                            {
                            latLng:[55.195577,61.367244], 
                            data : { 
                                text : '<p class="tc infowindow">СантехУрал" Торговый дом <br />Челябинск, ул. Северо-Крымская, 18а<br />7 (351) 729-88-58</p>'
                            }
                        },                                                                                            {
                            latLng:[56.853478,60.643709], 
                            data : { 
                                text : '<p class="tc infowindow">Уралэнерготехкомплект"<br />Екатеринбург, ул.Блюхера, д.45, оф.1<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[53.218818,34.399349], 
                            data : { 
                                text : '<p class="tc infowindow">Атлантика "РУНО"<br />Москва<br />7(495) 988-34-42</p>'
                            }
                        },                                                                                            {
                            latLng:[50.573208,36.500849], 
                            data : { 
                                text : '<p class="tc infowindow">Пластик Импорт "СтройАльянс"<br />Брянск, пер. Гаражный, д. 2<br />7(4832) 30-60-30, 30-70-30</p>'
                            }
                        },                                                                                            {
                            latLng:[53.193822,50.291223], 
                            data : { 
                                text : '<p class="tc infowindow">Универсал Самара"<br />Самара проспект Кирова д.10 Литер К<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[46.357636,48.085095], 
                            data : { 
                                text : '<p class="tc infowindow">АНГАРА"<br /> Астрахань, ул. Славянская / Рыбинская 1/12<br />7(8512) 622-205, 491-565,</p>'
                            }
                        },                                                                                            {
                            latLng:[57.951097,56.101292], 
                            data : { 
                                text : '<p class="tc infowindow">Седлов"<br />Пермь, Шоссе Космонавтов, 320Б, корп.5<br />7 (342) 200-99-29</p>'
                            }
                        },                                                                                            {
                            latLng:[55.844073,37.508651], 
                            data : { 
                                text : '<p class="tc infowindow">ТДС-Север"<br />Москва, Кронштадтский бульвар, д. 20А, корп. 8<br />7 (495) 780-30-50</p>'
                            }
                        },                                                                                            {
                            latLng:[55.010209,82.958168], 
                            data : { 
                                text : '<p class="tc infowindow">Вся сантехника"<br />Новосибирск, ул. Никитина, д. 20 <br />7 (383) 353-51-11</p>'
                            }
                        },                                                                                            {
                            latLng:[50.7482811,25.3196922], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Луцк, ул. Шевченко, 13-б<br />38 (0332) 70-11-12 </p>'
                            }
                        },                                                                                            {
                            latLng:[48.4017700,35.0395243], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Днепр, ул. Стартовая, 9а<br />38 (056) 790-25-35 </p>'
                            }
                        },                                                                                            {
                            latLng:[48.6208000,22.2878830], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Ужгород, ул. Бабьяка, 48<br />38 (0312) 42-41-50 </p>'
                            }
                        },                                                                                            {
                            latLng:[50.522909,30.60634], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Киев, ул. Оноре де Бальзака, 65/1<br />38 (044) 206-37-77 </p>'
                            }
                        },                                                                                            {
                            latLng:[50.365175,30.436141], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Киевская обл., пгт.Чабаны, Одесское шоссе, 8 <br />38 (044) 247 -47- 47</p>'
                            }
                        },                                                                                            {
                            latLng:[49.809728,23.977872], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Львов, ул. Щирецкая, 7<br />38 (032) 242-21-61 </p>'
                            }
                        },                                                                                            {
                            latLng:[49.109585,33.408712], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Кременчуг, ул. Киевская, 66-г<br />38 (0536) 79-29-00 </p>'
                            }
                        },                                                                                            {
                            latLng:[49.922493,36.269557], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Харьков, пр. Гагарина, 318-в<br />38 (057) 728-25-60 </p>'
                            }
                        },                                                                                            {
                            latLng:[46.660924,32.567572], 
                            data : { 
                                text : '<p class="tc infowindow">НОВАЯ ЛИНИЯ"<br />Херсон, ул. Нефтяников, 37<br />38 (0552) 41-47-80</p>'
                            }
                        },                                                                                            {
                            latLng:[50.616959,26.267406], 
                            data : { 
                                text : '<p class="tc infowindow">Ольвия"<br />Ровно, ул.Крушельницкой, 77<br />38 (0362) 22-10-08</p>'
                            }
                        },                                                                                            {
                            latLng:[50.618389,26.270238], 
                            data : { 
                                text : '<p class="tc infowindow">Ольвия"<br />Ровно, ул.Орлова, 2<br />38 (0362) 26-19-10</p>'
                            }
                        },                                                                                            {
                            latLng:[50.779892,25.314817], 
                            data : { 
                                text : '<p class="tc infowindow">Будматеріали"<br />Здолбунов, ул.Хмельницкого, 8<br />38 (03652) 2-33-65</p>'
                            }
                        },                                                                                            {
                            latLng:[50.442638,30.357429], 
                            data : { 
                                text : '<p class="tc infowindow">Практикер"<br />Киев, ул. Кольцевая дорога, 12<br />38 (044) 354-33-00</p>'
                            }
                        },                                                                                            {
                            latLng:[46.988362,32.002355], 
                            data : { 
                                text : '<p class="tc infowindow">Практикер"<br />Николаев, просп. Героев Сталинграда, 9Т<br />38 (0512) 76 91 00</p>'
                            }
                        },                                                                                            {
                            latLng:[50.518052,30.479461], 
                            data : { 
                                text : '<p class="tc infowindow">ЛЕРУА МЕРЛЕН"<br />Киев, ул. Полярная, 17А<br />38 (044) 498 96 96</p>'
                            }
                        },                                                                                            {
                            latLng:[49.872264,24.060484], 
                            data : { 
                                text : '<p class="tc infowindow">АРС-керамика"<br />Львов, ул. Б.Хмельницкого, 230<br />38 (032) 245-93-11</p>'
                            }
                        },                                                                                            {
                            latLng:[44.547374,33.43753], 
                            data : { 
                                text : '<p class="tc infowindow">ДОБРОСТРОЙ"<br />Севастополь, Фиолентовское шоссе, 2-а<br />38 (0692) 43-04-64</p>'
                            }
                        },                                                                                            {
                            latLng:[50.487016,30.609602], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Киев, ул. Братиславская, 11<br />38 (044) 561-2750</p>'
                            }
                        },                                                                                            {
                            latLng:[50.411075,30.388373], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Киев ул. Большая Окружная, 1Б<br />38 (044) 206-2603</p>'
                            }
                        },                                                                                            {
                            latLng:[50.390682,30.634686], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Киев, ул. Григоренко, 40<br />38 (044) 594-5145</p>'
                            }
                        },                                                                                            {
                            latLng:[49.82147,23.916053], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Львов, вул. Городоцкая, 302<br />38 (032) 295-6767</p>'
                            }
                        },                                                                                            {
                            latLng:[49.913692,36.276638], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Харьков, пр.Гагарина, 352<br />38 (057) 766-7987</p>'
                            }
                        },                                                                                            {
                            latLng:[48.936146,24.742559], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Ивано-Франковск, ул. Ивасюка, 17<br />38 (0342) 557-090</p>'
                            }
                        },                                                                                            {
                            latLng:[46.910552,32.042159], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Николаев, просп. Богоявленський, 234-В<br />38 (0512) 766-070</p>'
                            }
                        },                                                                                            {
                            latLng:[47.937104,33.405344], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Кривой Рог, ул. Быкова, 33<br />38 (0564) 287-098</p>'
                            }
                        },                                                                                            {
                            latLng:[49.571429,25.601017], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Тернополь, ул. Полесская,7<br />38 (0352) 476-200</p>'
                            }
                        },                                                                                            {
                            latLng:[50.452299,30.65065], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Киев, ул. Вискозная, 4<br />38 (044) 585-7663</p>'
                            }
                        },                                                                                            {
                            latLng:[49.42376,32.015509], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Черкассы, ул. 30-летия  Победы, 29<br />38 (0472) 339-288</p>'
                            }
                        },                                                                                            {
                            latLng:[50.622473,26.201445], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Ровно, ул. Макарова, 17<br />38 (0362) 683-952</p>'
                            }
                        },                                                                                            {
                            latLng:[50.438142,30.356251], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Киево-Святошинский р-н, с. Петропавловская Борщаговка, ул. Хрустальная, 6<br />38 (044) 561-2410</p>'
                            }
                        },                                                                                            {
                            latLng:[50.500503,30.36198], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Киев, ул. Берковецкая, 6В<br />38 (044) 206-26-06</p>'
                            }
                        },                                                                                            {
                            latLng:[47.821339,35.158028], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Запорожье, ул. Запорожская, 1-В<br />38 (061) 280-44-22</p>'
                            }
                        },                                                                                            {
                            latLng:[50.064674,36.19909], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Харьков, ул. Архитекторов,  7<br />38 (057) 766-12-40</p>'
                            }
                        },                                                                                            {
                            latLng:[48.498408,32.205838], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Кировоград, ул. Попова,8<br />38 (052) 235-36-91</p>'
                            }
                        },                                                                                            {
                            latLng:[48.700308,26.590763], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Каменец- Подольский,  ул. Хмельницкое шоссе,11<br />38 (03849) 649-99</p>'
                            }
                        },                                                                                            {
                            latLng:[51.503026,31.325988], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Черниговская обл., с. Новосёловка, ул. Шевченко,57<br />38 (0462) 97-52-12</p>'
                            }
                        },                                                                                            {
                            latLng:[46.673013,32.638189], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Херсон, Бериславское шоссе, 17<br />38 (0552) 32-65-75</p>'
                            }
                        },                                                                                            {
                            latLng:[49.94415,24.048214], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Стрый, ул. Олега Ольжича 18<br />38 (03245) 425-55</p>'
                            }
                        },                                                                                            {
                            latLng:[48.545819,24.99799], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Коломыя, ул. Карпатская, 184<br />38 (03433) 440-00</p>'
                            }
                        },                                                                                            {
                            latLng:[48.601105,34.572938], 
                            data : { 
                                text : '<p class="tc infowindow">ЭПИЦЕНТР"<br />Каменское (Днепродзержинск), перекресток бульв. Строителей и просп. Дружбы народов<br />38 (056) 462-00-98</p>'
                            }
                        },                                                                                            {
                            latLng:[51.51566,31.306483], 
                            data : { 
                                text : '<p class="tc infowindow">ВЕНА"<br />Чернигов, ул. Проектная, 1<br />38 (0462) 60-15-55</p>'
                            }
                        },                                                                                            {
                            latLng:[46.956853,32.069797], 
                            data : { 
                                text : '<p class="tc infowindow">33 кв.м"<br />Николаев, ул. Космонавтов, 81<br />38 (0512) 58-27-45</p>'
                            }
                        },                                                                                            {
                            latLng:[46.231732,34.623689], 
                            data : { 
                                text : '<p class="tc infowindow">33 кв.м"<br />Геническ, ул. Ленина, 25<br />38 (05534) 3-21-37</p>'
                            }
                        },                                                                                            {
                            latLng:[46.754578,33.34185], 
                            data : { 
                                text : '<p class="tc infowindow">33 кв.м"<br />Новая Каховка, пр. Днепровский<br />38 (0554) 99-01-86</p>'
                            }
                        },                                                                                            {
                            latLng:[46.649156,32.562572], 
                            data : { 
                                text : '<p class="tc infowindow">Стройка"<br />Херсон, ул. Лавренева, 12<br />38 (0552) 38-01-58</p>'
                            }
                        },                                                                                            {
                            latLng:[46.66275,32.643296], 
                            data : { 
                                text : '<p class="tc infowindow">Стройка"<br />Херсон, ул. Мира, 22<br />38 (0552) 34-25-06</p>'
                            }
                        },                                                                                            {
                            latLng:[46.644472,32.584995], 
                            data : { 
                                text : '<p class="tc infowindow">33 кв.м"<br />Херсон, ул. Розы Люксембург, 21а<br />38 (0552) 45-37-88</p>'
                            }
                        },                                                                                            {
                            latLng:[46.647757,32.587441], 
                            data : { 
                                text : '<p class="tc infowindow">Строй-ка"<br />Херсон, ул. Розы Люксембург, 11а<br />38 (0552) 42-96-78</p>'
                            }
                        },                                                                                            {
                            latLng:[46.650968,32.607655], 
                            data : { 
                                text : '<p class="tc infowindow">Строй-ка"<br />Херсон, ул. Ушакова, 79<br />38 (0552) 45-46-08</p>'
                            }
                        },                                                                                            {
                            latLng:[46.636251,32.611474], 
                            data : { 
                                text : '<p class="tc infowindow">Строй-ка"<br />Херсон, ул. Декабристов, 18<br />38 (0552) 49-56-80</p>'
                            }
                        },                                                                                            {
                            latLng:[46.643161,32.55931], 
                            data : { 
                                text : '<p class="tc infowindow">33 кв.м"<br />Херсон, ул. Димитрова, 9<br />38 (0552) 41-29-27</p>'
                            }
                        },                                                                                            {
                            latLng:[46.62044,32.577163], 
                            data : { 
                                text : '<p class="tc infowindow">33 кв.м"<br />Херсон, ул. Шенгелия, 3а<br />38 (0552) 47-01-36</p>'
                            }
                        },                                                                                            {
                            latLng:[46.624625,32.727646], 
                            data : { 
                                text : '<p class="tc infowindow">33 кв.м"<br />Цюрупинск, ул. Пролетарская, 101<br />38 (05542) 442-31</p>'
                            }
                        },                                                                                            {
                            latLng:[44.973041,34.142736], 
                            data : { 
                                text : '<p class="tc infowindow">Каиса"<br />Симферополь, ул. Глинки, 64<br />38 (0652) 51-40-46</p>'
                            }
                        },                                                                                            {
                            latLng:[50.611608,26.308969], 
                            data : { 
                                text : '<p class="tc infowindow">МАЯК"<br />Ровно, ул.Киевская, 98<br />38 (0362) 28-15-81</p>'
                            }
                        },                                                                                            {
                            latLng:[55.05083,82.965335], 
                            data : { 
                                text : '<p class="tc infowindow">Керамик"<br />Новосибирск, Проспект дзержинского 14<br />7 (383) 287-94-27</p>'
                            }
                        },                                                                                            {
                            latLng:[54.992622,82.96512], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехника сибири"<br />Новосибирск, Большевистcкая 92<br />7 (383) 230-30-83</p>'
                            }
                        },                                                                                            {
                            latLng:[55.061646,82.918986], 
                            data : { 
                                text : '<p class="tc infowindow">Стройся"<br />Новосибирск, Дуси Ковальчук 272<br />7 (913) 884-08-58</p>'
                            }
                        },                                                                                            {
                            latLng:[54.938619,83.120796], 
                            data : { 
                                text : '<p class="tc infowindow">ТЦ 16"<br />Новосибирск, Шукшина 13/1<br />7 (383) 338-78-89</p>'
                            }
                        },                                                                                            {
                            latLng:[54.63407,83.290569], 
                            data : { 
                                text : '<p class="tc infowindow">Коткина"<br />Искитим, Ленинградская 19а <br />7 (960) 792-30-58</p>'
                            }
                        },                                                                                            {
                            latLng:[54.646041,83.303443], 
                            data : { 
                                text : '<p class="tc infowindow">Коткина"<br />Искитим, Пушкина 37 <br />7 (960) 793-52-07</p>'
                            }
                        },                                                                                            {
                            latLng:[54.767053,83.096892], 
                            data : { 
                                text : '<p class="tc infowindow">Строй Мастер"<br />Бердск, Промышленный переулок 2а Бердск<br />7 (383) 212-52-97</p>'
                            }
                        },                                                                                            {
                            latLng:[54.627351,83.289625], 
                            data : { 
                                text : '<p class="tc infowindow">Идея вашего ремонта"<br />Искитим, Юбилейный проспект 1Б<br />7 (38343) 2-87-12</p>'
                            }
                        },                                                                                            {
                            latLng:[54.625376,83.289839], 
                            data : { 
                                text : '<p class="tc infowindow">Идея вашего ремонта"<br />Искитим, Юбилейный проспект 1Г<br />7 (38343) 2-87-12</p>'
                            }
                        },                                                                                            {
                            latLng:[54.961515,82.914845], 
                            data : { 
                                text : '<p class="tc infowindow">ИП Шершнев"<br />Новосибирск, Бетонная 8<br />7 (923) 120-29-77</p>'
                            }
                        },                                                                                            {
                            latLng:[55.030113,82.914351], 
                            data : { 
                                text : '<p class="tc infowindow">ИП Шершнев"<br />Новосибирск, Ленина 10<br />7 (923) 120-29-77</p>'
                            }
                        },                                                                                            {
                            latLng:[54.953864,82.878152], 
                            data : { 
                                text : '<p class="tc infowindow">Вся сантехника"<br />Новосибирск, Северный проезд 37/1<br />7 (383) 319-11-63</p>'
                            }
                        },                                                                                            {
                            latLng:[55.082015,82.965185], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехника монтаж"<br />Новосибирск, Учительская/Б. Хмельницкого 63<br />7 (383) 390-09-39</p>'
                            }
                        },                                                                                            {
                            latLng:[53.346286,83.717448], 
                            data : { 
                                text : '<p class="tc infowindow">Хелми"<br />Барнаул, Автотранспортная 49/1<br />7 (3852) 46-12-01 </p>'
                            }
                        },                                                                                            {
                            latLng:[53.339893,83.748647], 
                            data : { 
                                text : '<p class="tc infowindow">Алтай Сантехника"<br />Барнаул, Полюсный 81<br />7 (3852) 62-22-33</p>'
                            }
                        },                                                                                            {
                            latLng:[56.509656,85.030807], 
                            data : { 
                                text : '<p class="tc infowindow">Стройся"<br />Томск, Иркутский тракт, 96<br />7 (3822) 90-80-15</p>'
                            }
                        },                                                                                            {
                            latLng:[55.061431,82.919085], 
                            data : { 
                                text : '<p class="tc infowindow">Стройся"<br />Томск, Д. Ковальчук, 272 <br />7 (383) 228-13-13</p>'
                            }
                        },                                                                                            {
                            latLng:[56.517126,84.921288], 
                            data : { 
                                text : '<p class="tc infowindow">Стройся"<br />Томск, ул. Нижне-Луговая, 16/1 <br />7 (3822) 90-80-13 </p>'
                            }
                        },                                                                                            {
                            latLng:[56.464897,84.982463], 
                            data : { 
                                text : '<p class="tc infowindow">Стройся"<br />Томск, просп. Кирова, 51а<br />7 (3822) 90-80-01</p>'
                            }
                        },                                                                                            {
                            latLng:[56.505784,84.947638], 
                            data : { 
                                text : '<p class="tc infowindow">Стройся"<br />Томск, просп. Ленина, 174<br />7 (3822) 40-58-99 </p>'
                            }
                        },                                                                                            {
                            latLng:[55.034368,73.374635], 
                            data : { 
                                text : '<p class="tc infowindow">Импэкс-Сити"<br />Омск, ул.Осоавиахимовская 294      <br />7 (3822) 354-384</p>'
                            }
                        },                                                                                            {
                            latLng:[54.967145,73.412658], 
                            data : { 
                                text : '<p class="tc infowindow">Аква Леди"                                                   <br />Омск, ул.Б.Хмельницкого д.182              <br />7 (3822) 32-32-17</p>'
                            }
                        },                                                                                            {
                            latLng:[54.960136,73.467955], 
                            data : { 
                                text : '<p class="tc infowindow">КЕРАМИКА"                                                 <br />Омск, ул.Кордная 53                              <br /></p>'
                            }
                        },                                                                                            {
                            latLng:[54.993964,73.441648], 
                            data : { 
                                text : '<p class="tc infowindow">Ресурс-трейд"                                            <br />Омск, ул.Омская 221                           <br />7 (3822) 36-70-88</p>'
                            }
                        },                                                                                            {
                            latLng:[54.975298,73.382296], 
                            data : { 
                                text : '<p class="tc infowindow">"Стройкомплект"                                          <br />Омск, пр.К.Маркса д.41/17               <br /></p>'
                            }
                        },                                                                                            {
                            latLng:[54.987378,73.361975], 
                            data : { 
                                text : '<p class="tc infowindow">И.П. Воронцов Дмитрий Александрович                                                                         <br />Омск,   ул.Алексеева 1-В 4     <br />7 (3822) 36-74-30</p>'
                            }
                        },                                                                                            {
                            latLng:[54.976382,73.392381], 
                            data : { 
                                text : '<p class="tc infowindow">И.П. Гортэ Ольга Геннадьевна                                               <br />Омск, ул.Съездовская 50-200                                <br />7 (3822) 64-44-61</p>'
                            }
                        },                                                                                            {
                            latLng:[54.997041,73.378648], 
                            data : { 
                                text : '<p class="tc infowindow">И.П. Полищук Светлана Федоровна                                    <br />Омск, ул.Гусарова 33                                                <br />7 (3822) 25-32-87</p>'
                            }
                        },                                                                                            {
                            latLng:[55.834301,49.19389], 
                            data : { 
                                text : '<p class="tc infowindow">Риф"<br />Казань, Сибирский тракт, 2-Й ПЕРЕЕЗД<br />7 (843) 273-94-54</p>'
                            }
                        },                                                                                            {
                            latLng:[55.82854,49.195122], 
                            data : { 
                                text : '<p class="tc infowindow">ХозАрсенал"<br />Казань, Журналистов, 100а<br />7 (843) 273-00-35</p>'
                            }
                        },                                                                                            {
                            latLng:[55.756136,49.189543], 
                            data : { 
                                text : '<p class="tc infowindow">Магазин сантехники"<br />Казань, Мавлютова, д.7<br />7 (904) 713-30-42</p>'
                            }
                        },                                                                                            {
                            latLng:[55.769537,49.176196], 
                            data : { 
                                text : '<p class="tc infowindow">Мир сантехники"<br />Казань, Гвардейская, д. 54<br />7 (843) 274-21-85</p>'
                            }
                        },                                                                                            {
                            latLng:[55.752031,49.209842], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Казань, пр.Победы, д.33<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[55.862681,49.077319], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Казань, Челюскина, д.31<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[55.840518,49.135233], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Казань, Амирхана, д.30<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[55.830143,49.145426], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Казань, Адоратского, д.21а<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[55.821176,49.146735], 
                            data : { 
                                text : '<p class="tc infowindow">Магазин сантехники"<br />Казань, Адоратского, д.53б/1<br />7 (843) 525-24-79</p>'
                            }
                        },                                                                                            {
                            latLng:[55.741185,49.19628], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, пр.Победы, д.18б<br />7 (843) 228-98-81</p>'
                            }
                        },                                                                                            {
                            latLng:[55.744627,49.133152], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Техническая, д.10б<br />7 (843) 278-50-00</p>'
                            }
                        },                                                                                            {
                            latLng:[55.779614,49.236621], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Глушко, д.8<br />7 (843) 276-15-22</p>'
                            }
                        },                                                                                            {
                            latLng:[55.865294,49.0632], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Беломорская, д.45<br />7 (843) 510-45-67</p>'
                            }
                        },                                                                                            {
                            latLng:[55.850481,48.895508], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Залесная, д.66<br />7 (843) 555-93-99</p>'
                            }
                        },                                                                                            {
                            latLng:[55.861754,49.085559], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Ленинградская, д.22<br />7 (843) 510-75-53</p>'
                            }
                        },                                                                                            {
                            latLng:[55.730856,49.097918], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Магистральная, д.77 к.2<br />7 (843) 278-72-63</p>'
                            }
                        },                                                                                            {
                            latLng:[55.860983,49.218443], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Мира, д.45а<br />7 (843) 239-97-28</p>'
                            }
                        },                                                                                            {
                            latLng:[55.81645,49.0815], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Поперечно-Базарная, д.57<br />7 (843) 518-29-18</p>'
                            }
                        },                                                                                            {
                            latLng:[55.820718,49.053863], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Фрунзе, д.17<br />7 (843) 554-55-13</p>'
                            }
                        },                                                                                            {
                            latLng:[55.826407,49.125617], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Ямашева, д.51б<br />7 (843) 517-42-47</p>'
                            }
                        },                                                                                            {
                            latLng:[55.75034,49.23808], 
                            data : { 
                                text : '<p class="tc infowindow">Колорит"<br />Казань, Кул Гали, д.27<br />7 (843) 203-01-20</p>'
                            }
                        },                                                                                            {
                            latLng:[55.840723,48.565314], 
                            data : { 
                                text : '<p class="tc infowindow">ТД Берёзка"<br />Зеленодольск, ул. Татарстана, д.18<br />7 (84371) 3-30-25</p>'
                            }
                        },                                                                                            {
                            latLng:[55.852818,48.566044], 
                            data : { 
                                text : '<p class="tc infowindow">ТД Берёзка"<br />Зеленодольск, ул. Королева, д.1<br />7 (84371) 3-30-25</p>'
                            }
                        },                                                                                            {
                            latLng:[55.848843,48.49665], 
                            data : { 
                                text : '<p class="tc infowindow">Pioneer"<br />Зеленодольск, Зеленодольск, ул.Энгельса, д.17<br />7 (84371) 5-44-84</p>'
                            }
                        },                                                                                            {
                            latLng:[55.709585,52.391646], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Набережные Челны, Орловское кольцо, база "Саха-Автосервис"<br />7 (8552) 39-46-46</p>'
                            }
                        },                                                                                            {
                            latLng:[55.694809,52.295252], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Набережные Челны, пос.ГЭС, д.10/70<br />7 (8552) 39-46-47</p>'
                            }
                        },                                                                                            {
                            latLng:[55.74999,52.442673], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Набережные Челны, пр.Московский, д.161<br />7 (8552) 39-46-48</p>'
                            }
                        },                                                                                            {
                            latLng:[55.744217,52.420357], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Набережные Челны, ул.Рубаненко, д.1/16<br />7 (8552) 39-46-49</p>'
                            }
                        },                                                                                            {
                            latLng:[55.750231,52.442716], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Набережные Челны, пр.Московский, д.183<br />7 (8552) 39-46-51</p>'
                            }
                        },                                                                                            {
                            latLng:[55.720536,52.367013], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Набережные Челны, ул.Ш.Усманова, д.44/11<br />7 (8552) 39-46-52</p>'
                            }
                        },                                                                                            {
                            latLng:[55.736969,52.399279], 
                            data : { 
                                text : '<p class="tc infowindow">Галерея сантехники"<br />Набережные Челны, пр.Беляева, д.12<br />7 (8552) 39-46-53</p>'
                            }
                        },                                                                                            {
                            latLng:[54.379258,48.57639], 
                            data : { 
                                text : '<p class="tc infowindow">СтройГрад"<br />Ульяновск, пр-т Ульяновский д.24<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[51.510706,45.98102], 
                            data : { 
                                text : '<p class="tc infowindow">СТРОЙГРАД"<br />Саратов,  ул. Верхняя 17<br />7 (8452) 72-71-11</p>'
                            }
                        },                                                                                            {
                            latLng:[51.555061,46.018013], 
                            data : { 
                                text : '<p class="tc infowindow">СТРОЙГРАД"<br />Саратов, ул. Танкистов, 55<br />7 (8452) 64-00-59</p>'
                            }
                        },                                                                                            {
                            latLng:[51.530012,46.052774], 
                            data : { 
                                text : '<p class="tc infowindow">СТРОЙГРАД"<br />Саратов, ул. Тулупная, 4<br />7 (8452) 48-62-61</p>'
                            }
                        },                                                                                            {
                            latLng:[51.508208,46.18343], 
                            data : { 
                                text : '<p class="tc infowindow">СТРОЙГРАД"<br />Энгельс, ул. Студенческая, 205<br />7 (8453) 75-35-25</p>'
                            }
                        },                                                                                            {
                            latLng:[51.492566,46.144806], 
                            data : { 
                                text : '<p class="tc infowindow">СТРОЙГРАД"<br />Энгельс, ул. Полиграфическая, 54 Б<br />7 (8453) 76-56-67</p>'
                            }
                        },                                                                                            {
                            latLng:[48.527292,44.581894], 
                            data : { 
                                text : '<p class="tc infowindow">Set.K"<br />Волгоград, Красноармейский р-н, ул. Бахтурова, 12<br />7 (8442) 31-92-05</p>'
                            }
                        },                                                                                            {
                            latLng:[48.521252,44.571487], 
                            data : { 
                                text : '<p class="tc infowindow">ЛОМ"<br />Волгоград, Красноармейский р-н, пр-т Канатчиков, 5<br />7 (8442) 49-70-31</p>'
                            }
                        },                                                                                            {
                            latLng:[48.523455,44.584533], 
                            data : { 
                                text : '<p class="tc infowindow">Обойная сила"<br />Волгоград, Красноармейский р-н, ул. Удмуртская, 19<br />7 (8442) 62-74-50 </p>'
                            }
                        },                                                                                            {
                            latLng:[48.662609,44.446002], 
                            data : { 
                                text : '<p class="tc infowindow">Славянские обои"<br />Волгоград, Советский р-н, ул. Ухтомского, 5<br />7 (8442) 47-82-28 </p>'
                            }
                        },                                                                                            {
                            latLng:[48.775424,44.556077], 
                            data : { 
                                text : '<p class="tc infowindow">Обойная сила"<br />Волгоград, Краснооктябрьский р-н, ул. Генерала Штеменко<br />7(8442) 73-90-96 </p>'
                            }
                        },                                                                                            {
                            latLng:[48.788983,44.577259], 
                            data : { 
                                text : '<p class="tc infowindow">Славянские обои"<br />Волгоград, Краснооктябрьский р-н, ул. Маршала Еременко, 152<br />7 (8442) 75-19-53</p>'
                            }
                        },                                                                                            {
                            latLng:[47.23819,39.747952], 
                            data : { 
                                text : '<p class="tc infowindow">Билд"<br />Ростов-на-Дону, пр. Шолохова, 30/48<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[47.294323,39.706282], 
                            data : { 
                                text : '<p class="tc infowindow">Билд"<br />Ростов-на-Дону, пр. Королева, 10а<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[47.250208,39.629549], 
                            data : { 
                                text : '<p class="tc infowindow">Билд"<br />Ростов-на-Дону, пер. Элеваторный, 7<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[47.215706,39.612404], 
                            data : { 
                                text : '<p class="tc infowindow">Билд"<br />Ростов-на-Дону, ул. Малиновского 13Д/1<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[47.237593,39.745335], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехцентр"<br />Ростов-на-Дону, просп. Шолохова, 38<br />7 (863) 303-04-77</p>'
                            }
                        },                                                                                            {
                            latLng:[47.211989,39.650084], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехцентр"<br />Ростов-на-Дону, просп. Стачки, 168<br />7 (863) 224-40-05</p>'
                            }
                        },                                                                                            {
                            latLng:[47.248751,39.755849], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехцентр"<br />Ростов-на-Дону, просп. Ленина, 251<br />7 (863) 200-60-12</p>'
                            }
                        },                                                                                            {
                            latLng:[47.217834,39.716345], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехцентр"<br />Ростов-на-Дону, ул. Обороны, 58,<br />7 (863) 303-05-89</p>'
                            }
                        },                                                                                            {
                            latLng:[47.20403,39.723619], 
                            data : { 
                                text : '<p class="tc infowindow">Гранд фаянс"<br />Ростов-на-Дону,  ул. Пойменная, 1<br />7 (918) 891-00-56</p>'
                            }
                        },                                                                                            {
                            latLng:[47.133177,39.742288], 
                            data : { 
                                text : '<p class="tc infowindow">Гранд фаянс"<br />Ростов-на-Дону, ул. Куйбышева, 163<br />7 (86354) 5-65-44</p>'
                            }
                        },                                                                                            {
                            latLng:[45.058774,38.896963], 
                            data : { 
                                text : '<p class="tc infowindow">Золотой Век"<br />Краснодар, ул Калинина 327/1<br />7 (861) 255-53-13</p>'
                            }
                        },                                                                                            {
                            latLng:[45.040249,38.968996], 
                            data : { 
                                text : '<p class="tc infowindow">Золотой Век"<br />Краснодар, ул. Кирова 145<br />7 (861) 255-53-13</p>'
                            }
                        },                                                                                            {
                            latLng:[45.039461,38.968009], 
                            data : { 
                                text : '<p class="tc infowindow">ТК СКС"<br />Краснодар, р-н Сеного Рынка ул. Кирова 151<br /></p>'
                            }
                        },                                                                                            {
                            latLng:[45.043479,39.11641], 
                            data : { 
                                text : '<p class="tc infowindow">REDO"<br />Краснодар, ул. Уральская 212<br />7 (960) 495-12-27</p>'
                            }
                        },                                                                                            {
                            latLng:[45.043480,39.11642], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехника"<br />Краснодар, ул. Уральская 212/9 <br />7 (861) 260-01-35</p>'
                            }
                        },                                                                                            {
                            latLng:[44.034835,43.043701], 
                            data : { 
                                text : '<p class="tc infowindow">ЮФО-Оптторг"<br />Пятигорск, Черкесское шоссе, 19<br />7 (8793) 31-84-44 </p>'
                            }
                        },                                                                                            {
                            latLng:[44.033863,43.043679], 
                            data : { 
                                text : '<p class="tc infowindow">ЮФО-Оптторг"<br />Пятигорск, Черкесское шоссе, 31<br />7 (8793) 31-84-45</p>'
                            }
                        },                                                                                            {
                            latLng:[43.612186,39.728941], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехцентр"<br />Сочи, ул. Донская 28<br />7 (8622) 90-53-64</p>'
                            }
                        },                                                                                            {
                            latLng:[43.432167,39.932252], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехцентр"<br />Адлер, ул. Авиационая 19<br />7 (8622) 90-53-64</p>'
                            }
                        },                                                                                            {
                            latLng:[44.722604,37.761852], 
                            data : { 
                                text : '<p class="tc infowindow">Дом"<br />Новороссийск, Кутузовская 15<br />7 (8617) 61-33-34</p>'
                            }
                        },                                                                                            {
                            latLng:[44.899523,37.340445], 
                            data : { 
                                text : '<p class="tc infowindow">Сантехцентр"<br />Анапа,  Анапское шоссе 1 <br />7 (86133) 3-25-70</p>'
                            }
                        },                                                                                            {
                            latLng:[44.891771,37.337677], 
                            data : { 
                                text : '<p class="tc infowindow">Дом"<br />Анапа, Парковая 59/1<br />7 (86133) 3-03-37</p>'
                            }
                        },                                                                                            {
                            latLng:[56.957823,40.980674], 
                            data : { 
                                text : '<p class="tc infowindow">Аксон"<br />Иваново, пр-т Текстильщиков, 125<br />7 (4932) 35-99-99</p>'
                            }
                        },                                                                                            {
                            latLng:[57.678021,39.759218], 
                            data : { 
                                text : '<p class="tc infowindow">Аксон"<br />Ярославль, ул. Громова, 13<br />7 (4852) 51-15-15</p>'
                            }
                        },                                                                                            {
                            latLng:[57.590124,39.894659], 
                            data : { 
                                text : '<p class="tc infowindow">Аксон"<br />Ярославль, пр-т Фрунзе,30<br />7 (4852) 26-15-15</p>'
                            }
                        },                                                                                            {
                            latLng:[57.746885,40.986897], 
                            data : { 
                                text : '<p class="tc infowindow">Аксон"<br />Кострома, ул. Сутырина, 5<br />7 (4942) 41-21-51</p>'
                            }
                        },                                                                                            {
                            latLng:[59.196922,39.825132], 
                            data : { 
                                text : '<p class="tc infowindow">Аксон"<br />Вологда, Окружное шоссе, 18<br />7 (8172) 51-55-51</p>'
                            }
                        },                                                                                            {
                            latLng:[59.078859,37.923339], 
                            data : { 
                                text : '<p class="tc infowindow">Аксон"<br />Череповец, ул. Рыбинская, д.59<br />7 (8202) 31-08-40</p>'
                            }
                        },                                                                                            {
                            latLng:[48.461806,35.059545], 
                            data : { 
                                text : '<p class="tc infowindow">HOВИЙ СВІТ"<br />Днепр, ул. Вернадского, 23<br />38 (0562) 36-91-56</p>'
                            }
                        },                                                                                            {
                            latLng:[48.521252,35.080579], 
                            data : { 
                                text : '<p class="tc infowindow">HOВИЙ СВІТ"<br />Днепр, пр. Слобожанский, 117<br />38 (056) 376-46-37</p>'
                            }
                        },                                                                                            {
                            latLng:[48.439457, 35.020568], 
                            data : { 
                                text : '<p class="tc infowindow">HOВИЙ СВІТ"<br />Днепр, пр. Богдана Хмельницького, 20<br />38 (0562) 31-31-26</p>'
                            }
                        },                                                                                            {
                            latLng:[47.001797,28.870654], 
                            data : { 
                                text : '<p class="tc infowindow">Bicomplex"<br />Кишинев, Chisinau, sos.Muncesti 89<br />373 (22) 50-50-90</p>'
                            }
                        }                                            ],
                cluster:{
                    radius: 70,
                    0: {
                      content: "<div class='cluster cluster-1'>CLUSTER_COUNT</div>",
                      width: 53,
                      height: 52
                    },
                    events: {
                      click: function(cluster) {
                        var map = $(this).gmap3("get");
                        map.setCenter(cluster.main.getPosition());
                        map.setZoom(map.getZoom() + 1);
                      }
                    }
                },
                events:{
                    click: function(marker, event, context){
                        var map = $(this).gmap3('get'),
                        infowindow = $(this).gmap3({get:'infowindow'});
                        if (infowindow) {
                             infowindow.open(map, marker);
                             infowindow.setContent(context.data.text);
                        } else {
                             $(this).gmap3({
                                  infowindow: {
                                    anchor: marker,
                                    options: {
                                         content: context.data.text
                                    }
                                  }
                             });
                        }
                    }
                }
            },
                        autofit:{}
        });
        $("select").sb({
            fixedWidth: true
        });
        
        $("select#country").change(function () {
            var LINK = changeLocation('c');
            window.location.href = LINK;
        });
        
        $("select#location").change(function () {
            var LINK = changeLocation('l');
            window.location.href = LINK;
        });
        
        $("select#type").change(function () {
            var LINK = changeLocation('t');
            window.location.href = LINK;
        });
        
        function changeLocation(type) {
            var LINK = ROOT;
            var param = false;
            if ($('#type').val() != "") {
                LINK = LINK+"/t/"+$('#type').val();
                param = true;
            }
            if ($('#country').val() != "") {
                LINK = LINK+"/c/"+$('#country').val();
                param = true;
            }
            if (type == 'l' && $('#location').val() != "") {
                param = true;
                LINK = LINK+"/l/"+$('#location').val();
            }
            if (!param) {
                LINK = LINK+".html";
            }
            return LINK;
        }
    });

//]]>