<? get_header(); ?>
<section>
			<div class="row">
				<h1 class="page-title">Весенняя акция – скидка 10% на ванны Фортуна</h1>
				<div class="post-page">
					<article class="main-news">
						<div class="post-image">
							<img src="images/new-img1.jpg" alt="">
						</div>
						<p>Весна – лучшее время для обновлений. Воспользуйтесь уникальной возможностью обновить вашу ванную комнату и приобретите ванну Фортуна по уникальной цене со скидкой 10%.</p>
						<p>Акционные цены:
						ванна «Фортуна» 150*70 см - 1959 грн.
						ванна «Фортуна» 160*70 см - 2070 грн.
						ванна «Фортуна» 170*75 см - 2241 грн.</p>
						<p>Акриловая ванна Фортуна - традиционная прямоугольная ванна, которая отличается высокой функциональностью и комфортом. Она достаточно вместительна, имеет удобную спинку и широкие полочки, на которых могут свободно расположиться ваши ванные принадлежности.</p>
						<p>Прямоугольные ванны Фортуна изготавливаются из высококачественного санитарного акрила в трех наиболее популярных типоразмерах. Эта ванна эргономична благодаря большому внутреннему пространству.</p>
						<p>Они могут встраиваться или быть оборудованы декоративными панелями. Ванны Colombo поставляются в комплекте с ножками и настенными крепежными элементами.</p>
						<p>Цена указана с учетом НДС на ванну в комплекте в комплекте с ножками и элементами креплений.</p>
						<p>Акция действительна на территории Украины с 01 мая 2016г. по 30 июня 2016г. Условия акции могут быть изменены на протяжении действия акции.</p>
					</article>
					<div class="else-news">
						<h5 class="else-news-title">Последние новости от colombo</h5>
						<div class="news-novelties colums">
							<div class="colum-1-3">
								<article>
									<div class="post-image">
										<a href="#">
											<img src="images/post-img4.jpg" alt="">
										</a>
									</div>
									<div class="post-content">
										<p class="post-date">14.04.2016</p>
										<h3 class="post-title">
											<a href="#">Весенняя акция – скидка 10% на ванны Фортуна</a>
										</h3>
										<p class="post-description">Весна – лучшее время для обновлений. Воспользуйтесь уникальной возможностью обновить вашу ванную комнату и приобретите ванну Фортуна по уникальной цене со скидкой 10%.</p>
										<a href="#" class="read-more">подробнее</a>
									</div>
								</article>
							</div>
							<div class="colum-1-3">
								<article>
									<div class="post-image">
										<a href="#">
											<img src="images/post-img5.jpg" alt="">
										</a>
									</div>
									<div class="post-content">
										<p class="post-date">14.04.2016</p>
										<h3 class="post-title">
											<a href="#">НОВИНКА! Серия СТАТУС / STATUS</a>
										</h3>
										<p class="post-description">Новинка от colombo – серия СТАТУС. Стильный современный компакт с системой скрытого монтажа, широкая линейка функциональных умывальников. Серия разработана известным немецким дизайнером Берндом Брохамером.</p>
										<a href="#" class="read-more">подробнее</a>
									</div>
								</article>
							</div>
							<div class="colum-1-3">
								<article>
									<div class="post-image">
										<a href="#">
											<img src="images/post-img6.jpg" alt="">
										</a>
									</div>
									<div class="post-content">
										<p class="post-date">14.04.2016</p>
										<h3 class="post-title">
											<a href="#">НОВИНКА! Компакт «Коломбо NEW»</a>
										</h3>
										<p class="post-description">Новый бачок прямоугольной формы отличает этот компакт, делая его особенным и современным. </p>
										<a href="#" class="read-more">подробнее</a>
									</div>
								</article>
							</div>
						</div>
					</div>
				</div>
			</div>
		</section>
<? get_footer(); ?>
